jdesbonnet/codex_experiment_06/projects/sd_fat32_ro/stm32f103c8_c/main.c
static uint8_t sd_send_command_selected(uint8_t cmd, uint32_t arg, uint8_t crc)
{
    uint8_t r1 = 0xFFu;
    uint32_t i;

    sd_spi_xfer((uint8_t)(0x40u | cmd));
    sd_spi_xfer((uint8_t)(arg >> 24));
    sd_spi_xfer((uint8_t)(arg >> 16));
    sd_spi_xfer((uint8_t)(arg >> 8));
    sd_spi_xfer((uint8_t)arg);
    sd_spi_xfer(crc);

    for (i = 0u; i < 10u; i++) {
        r1 = sd_spi_xfer(0xFFu);
        if ((r1 & 0x80u) == 0u) {
            break;
        }
    }

    return r1;
}

static uint8_t sd_send_command(uint8_t cmd, uint32_t arg, uint8_t crc)
{
    uint8_t r1;

    sd_deselect();
    if (!sd_select()) {
        sd_deselect();
        return 0xFFu;
    }

    r1 = sd_send_command_selected(cmd, arg, crc);
    sd_deselect();
    return r1;
}

static uint8_t sd_send_app_command(uint8_t acmd, uint32_t arg)
{
    uint8_t r1 = sd_send_command(SD_CMD55, 0u, 0xFFu);
    if (r1 > 0x01u) {
        return r1;
    }
    return sd_send_command(acmd, arg, 0xFFu);
}

static bool sd_read_data_selected(uint8_t *buffer, uint32_t length)
{
    uint32_t i;
    uint8_t token = 0xFFu;

    for (i = 0u; i < 100000u; i++) {
        token = sd_spi_xfer(0xFFu);
        if (token != 0xFFu) {
            break;
        }
    }

    if (token != SD_DATA_TOKEN) {
        return false;
    }

    for (i = 0u; i < length; i++) {
        buffer[i] = sd_spi_xfer(0xFFu);
    }

    /* Ignore the 16-bit CRC for now. */
    sd_spi_xfer(0xFFu);
    sd_spi_xfer(0xFFu);
    return true;
}

static bool sd_read_register(uint8_t cmd, uint8_t *buffer)
{
    uint8_t r1;

    sd_deselect();
    if (!sd_select()) {
        sd_deselect();
        return false;
    }

    r1 = sd_send_command_selected(cmd, 0u, 0xFFu);
    if (r1 != 0x00u && r1 != SD_R1_IDLE) {
        sd_deselect();
        return false;
    }

    if (!sd_read_data_selected(buffer, 16u)) {
        sd_deselect();
        return false;
    }

    sd_deselect();
    return true;
}

static bool sd_read_ocr(uint32_t *ocr_out)
{
    uint8_t r1;
    uint8_t ocr[4];

    sd_deselect();
    if (!sd_select()) {
        sd_deselect();
        return false;
    }

    r1 = sd_send_command_selected(SD_CMD58, 0u, 0xFFu);
    if (r1 != 0x00u && r1 != SD_R1_IDLE) {
        sd_deselect();
        return false;
    }

    ocr[0] = sd_spi_xfer(0xFFu);
    ocr[1] = sd_spi_xfer(0xFFu);
    ocr[2] = sd_spi_xfer(0xFFu);
    ocr[3] = sd_spi_xfer(0xFFu);
    sd_deselect();

    *ocr_out = ((uint32_t)ocr[0] << 24) |
               ((uint32_t)ocr[1] << 16) |
               ((uint32_t)ocr[2] << 8) |
               (uint32_t)ocr[3];
    return true;
}

static bool sd_read_block(uint32_t lba, uint8_t *buffer)
{
    uint32_t address = g_sd_is_sdhc ? lba : (lba * SD_SECTOR_SIZE);
    uint8_t r1;

    sd_deselect();
    if (!sd_select()) {
        sd_deselect();
        return false;
    }

    r1 = sd_send_command_selected(SD_CMD17, address, 0xFFu);
    if (r1 != 0x00u) {
        sd_deselect();
        return false;
    }

    if (!sd_read_data_selected(buffer, SD_SECTOR_SIZE)) {
        sd_deselect();
        return false;
    }

    sd_deselect();
    return true;
}

static uint32_t sd_extract_bits(const uint8_t *data, uint8_t msb, uint8_t lsb)
{
    uint32_t value = 0u;
    uint8_t bit;

    for (bit = msb; bit >= lsb; bit--) {
        uint8_t byte_index = (uint8_t)(15u - (bit / 8u));
        uint8_t bit_index = (uint8_t)(bit & 7u);
        value <<= 1;
        value |= (uint32_t)((data[byte_index] >> bit_index) & 1u);
        if (bit == lsb) {
            break;
        }
    }

    return value;
}

static void sd_print_bytes(const uint8_t *data, uint32_t length)
{
    uint32_t i;

    for (i = 0u; i < length; i++) {
        if (i != 0u) {
            usart1_putc(' ');
        }
        usart1_put_hex8(data[i]);
    }
    usart1_puts("\r\n");
}

static bool sector_has_string(const uint8_t *sector, uint32_t offset, const char *text, uint32_t length)
{
    uint32_t i;

    for (i = 0u; i < length; i++) {
        if (sector[offset + i] != (uint8_t)text[i]) {
            return false;
        }
    }

    return true;
}

static uint16_t read_le16(const uint8_t *p)
{
    return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static uint32_t read_le32(const uint8_t *p)
{
    return (uint32_t)p[0] |
           ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static uint64_t read_le64(const uint8_t *p)
{
    return (uint64_t)read_le32(p) | ((uint64_t)read_le32(p + 4) << 32);
}

static bool sd_is_exfat_boot_sector(const uint8_t *sector)
{
    return sector_has_string(sector, 3u, "EXFAT   ", 8u);
}

static bool sd_is_fat32_boot_sector(const uint8_t *sector)
{
    return sector_has_string(sector, 82u, "FAT32   ", 8u);
}

static bool sd_is_fat12_or_fat16_boot_sector(const uint8_t *sector)
{
    return sector_has_string(sector, 54u, "FAT12   ", 8u) ||
           sector_has_string(sector, 54u, "FAT16   ", 8u);
}

static void usart1_put_dec_u64(uint64_t value)
{
    char buffer[20];
    uint32_t i = 0u;

    if (value == 0u) {
        usart1_putc('0');
        return;
    }

    while (value != 0u) {
        buffer[i++] = (char)('0' + (value % 10u));
        value /= 10u;
    }

    while (i > 0u) {
        usart1_putc(buffer[--i]);
    }
}

static void usart1_put_escaped_byte(uint8_t value)
{
    if (value >= 32u && value <= 126u) {
        usart1_putc((char)value);
        return;
    }

    if (value == '\n') {
        usart1_puts("\\n");
        return;
    }

    if (value == '\r') {
        usart1_puts("\\r");
        return;
    }

    usart1_puts("\\x");
    usart1_put_hex8(value);
}

static void sd_print_sector_prefix(const uint8_t *sector)
{
    uint32_t offset;
    uint32_t i;

    for (offset = 0u; offset < 32u; offset += 16u) {
        usart1_puts("sd: sector0 ");
        usart1_put_hex16((uint16_t)offset);
        usart1_puts(": ");
        for (i = 0u; i < 16u; i++) {
            if (i != 0u) {
                usart1_putc(' ');
            }
            usart1_put_hex8(sector[offset + i]);
        }
        usart1_puts("\r\n");
    }
}

static bool sd_partition_type_is_fat_like(uint8_t type)
{
    switch (type) {
    case 0x01u:
    case 0x04u:
    case 0x06u:
    case 0x0Bu:
    case 0x0Cu:
    case 0x0Eu:
    case 0x07u:
        return true;
    default:
        return false;
    }
}

