jdesbonnet/codex_experiment_06/projects/sd_fat32_ro/stm32f103c8_c/main.c
static void sd_parse_partition_entry(const uint8_t *entry, sd_partition_t *part)
{
    part->boot = entry[0];
    part->type = entry[4];
    part->start_lba = read_le32(entry + 8);
    part->sector_count = read_le32(entry + 12);
}

static void sd_print_partition_entry(uint32_t index, const sd_partition_t *part)
{

    usart1_puts("sd: part");
    usart1_put_dec_u32(index);
    usart1_puts(" boot=0x");
    usart1_put_hex8(part->boot);
    usart1_puts(" type=0x");
    usart1_put_hex8(part->type);
    usart1_puts(" start_lba=");
    usart1_put_dec_u32(part->start_lba);
    usart1_puts(" sectors=");
    usart1_put_dec_u32(part->sector_count);
    usart1_puts("\r\n");
}

static bool sd_find_primary_volume(const uint8_t *mbr, uint32_t *start_lba_out, uint8_t *type_out)
{
    uint32_t i;
    bool found_any = false;
    bool found_fat = false;
    uint32_t first_start_lba = 0u;
    uint8_t first_type = 0u;
    uint32_t fat_start_lba = 0u;
    uint8_t fat_type = 0u;

    for (i = 0u; i < 4u; i++) {
        sd_partition_t part;

        sd_parse_partition_entry(mbr + 446u + (i * 16u), &part);
        sd_print_partition_entry(i, &part);

        if (part.type != 0u && part.start_lba != 0u && part.sector_count != 0u) {
            if (!found_any) {
                found_any = true;
                first_start_lba = part.start_lba;
                first_type = part.type;
            }
            if (!found_fat && sd_partition_type_is_fat_like(part.type)) {
                found_fat = true;
                fat_start_lba = part.start_lba;
                fat_type = part.type;
            }
        }
    }

    if (found_fat) {
        *start_lba_out = fat_start_lba;
        *type_out = fat_type;
        return true;
    }

    if (found_any) {
        *start_lba_out = first_start_lba;
        *type_out = first_type;
        return true;
    }

    return false;
}

static void sd_print_generic_bpb(const uint8_t *sector)
{
    uint16_t bytes_per_sector = read_le16(sector + 11u);
    uint8_t sectors_per_cluster = sector[13];
    uint16_t reserved = read_le16(sector + 14u);
    uint8_t fats = sector[16];
    uint16_t root_entries = read_le16(sector + 17u);
    uint32_t total_sectors = read_le16(sector + 19u);
    uint32_t fat_size = read_le16(sector + 22u);
    uint32_t hidden_sectors = read_le32(sector + 28u);

    if (total_sectors == 0u) {
        total_sectors = read_le32(sector + 32u);
    }
    if (fat_size == 0u) {
        fat_size = read_le32(sector + 36u);
    }

    usart1_puts("sd: BPB bytes_per_sector=");
    usart1_put_dec_u32(bytes_per_sector);
    usart1_puts(" sectors_per_cluster=");
    usart1_put_dec_u32(sectors_per_cluster);
    usart1_puts(" reserved=");
    usart1_put_dec_u32(reserved);
    usart1_puts(" fats=");
    usart1_put_dec_u32(fats);
    usart1_puts("\r\n");

    usart1_puts("sd: BPB root_entries=");
    usart1_put_dec_u32(root_entries);
    usart1_puts(" hidden_sectors=");
    usart1_put_dec_u32(hidden_sectors);
    usart1_puts(" total_sectors=");
    usart1_put_dec_u32(total_sectors);
    usart1_puts(" fat_sectors=");
    usart1_put_dec_u32(fat_size);
    usart1_puts("\r\n");
}

static void sd_print_boot_sector_summary(const uint8_t *sector, uint32_t lba)
{
    usart1_puts("sd: boot sector lba=");
    usart1_put_dec_u32(lba);
    usart1_puts(" signature=0x");
    usart1_put_hex8(sector[511]);
    usart1_put_hex8(sector[510]);
    usart1_puts("\r\n");

    if (sd_is_exfat_boot_sector(sector)) {
        uint64_t partition_offset = read_le64(sector + 64u);
        uint64_t volume_length = read_le64(sector + 72u);
        uint32_t fat_offset = read_le32(sector + 80u);
        uint32_t fat_length = read_le32(sector + 84u);
        uint32_t cluster_heap_offset = read_le32(sector + 88u);
        uint32_t cluster_count = read_le32(sector + 92u);
        uint32_t root_cluster = read_le32(sector + 96u);
        uint8_t sector_shift = sector[108];
        uint8_t cluster_shift = sector[109];
        uint32_t bytes_per_sector = 1u << sector_shift;
        uint32_t sectors_per_cluster = 1u << cluster_shift;

        usart1_puts("sd: filesystem=exFAT\r\n");
        usart1_puts("sd: exFAT bytes_per_sector=");
        usart1_put_dec_u32(bytes_per_sector);
        usart1_puts(" sectors_per_cluster=");
        usart1_put_dec_u32(sectors_per_cluster);
        usart1_puts(" fats=");
        usart1_put_dec_u32(sector[110]);
        usart1_puts(" root_cluster=");
        usart1_put_dec_u32(root_cluster);
        usart1_puts("\r\n");
        usart1_puts("sd: exFAT partition_offset=");
        usart1_put_dec_u64(partition_offset);
        usart1_puts(" volume_length=");
        usart1_put_dec_u64(volume_length);
        usart1_puts("\r\n");
        usart1_puts("sd: exFAT fat_offset=");
        usart1_put_dec_u32(fat_offset);
        usart1_puts(" fat_length=");
        usart1_put_dec_u32(fat_length);
        usart1_puts(" heap_offset=");
        usart1_put_dec_u32(cluster_heap_offset);
        usart1_puts(" cluster_count=");
        usart1_put_dec_u32(cluster_count);
        usart1_puts("\r\n");
        return;
    }

    if (sd_is_fat32_boot_sector(sector)) {
        usart1_puts("sd: filesystem=FAT32\r\n");
        sd_print_generic_bpb(sector);
        usart1_puts("sd: FAT32 root_cluster=");
        usart1_put_dec_u32(read_le32(sector + 44u));
        usart1_puts(" fsinfo=");
        usart1_put_dec_u32(read_le16(sector + 48u));
        usart1_puts(" backup_boot=");
        usart1_put_dec_u32(read_le16(sector + 50u));
        usart1_puts("\r\n");
        return;
    }

    if (sd_is_fat12_or_fat16_boot_sector(sector)) {
        usart1_puts("sd: filesystem=");
        if (sector_has_string(sector, 54u, "FAT12   ", 8u)) {
            usart1_puts("FAT12\r\n");
        } else {
            usart1_puts("FAT16\r\n");
        }
        sd_print_generic_bpb(sector);
        return;
    }

    usart1_puts("sd: filesystem type not recognized from boot sector\r\n");
}

static void sd_print_data_prefix(const char *label, const uint8_t *data, uint32_t count)
{
    uint32_t i;

    usart1_puts(label);
    for (i = 0u; i < count; i++) {
        if (i != 0u) {
            usart1_putc(' ');
        }
        usart1_put_hex8(data[i]);
    }
    usart1_puts("\r\n");
}

