jdesbonnet/codex_experiment_06/projects/sd_fat32_ro/stm32f103c8_c/main.c
static bool sd_probe_fat32_aux(uint32_t volume_lba, const uint8_t *boot_sector)
{
    uint16_t fsinfo_sector = read_le16(boot_sector + 48u);
    uint16_t reserved = read_le16(boot_sector + 14u);
    uint32_t fat_lba = volume_lba + (uint32_t)reserved;

    if (fsinfo_sector != 0u && fsinfo_sector != 0xFFFFu) {
        uint32_t fsinfo_lba = volume_lba + (uint32_t)fsinfo_sector;
        uint32_t lead_sig;
        uint32_t struct_sig;
        uint32_t free_count;
        uint32_t next_free;
        uint32_t trail_sig;

        usart1_puts("sd: reading FSInfo sector at lba ");
        usart1_put_dec_u32(fsinfo_lba);
        usart1_puts("\r\n");

        if (!sd_read_block(fsinfo_lba, g_sector0)) {
            return false;
        }

        lead_sig = read_le32(g_sector0 + 0u);
        struct_sig = read_le32(g_sector0 + 484u);
        free_count = read_le32(g_sector0 + 488u);
        next_free = read_le32(g_sector0 + 492u);
        trail_sig = read_le32(g_sector0 + 508u);

        usart1_puts("sd: FSInfo lead=0x");
        usart1_put_hex32(lead_sig);
        usart1_puts(" struct=0x");
        usart1_put_hex32(struct_sig);
        usart1_puts(" trail=0x");
        usart1_put_hex32(trail_sig);
        usart1_puts("\r\n");
        usart1_puts("sd: FSInfo free_clusters=");
        if (free_count == 0xFFFFFFFFu) {
            usart1_puts("unknown");
        } else {
            usart1_put_dec_u32(free_count);
        }
        usart1_puts(" next_free=");
        if (next_free == 0xFFFFFFFFu) {
            usart1_puts("unknown");
        } else {
            usart1_put_dec_u32(next_free);
        }
        usart1_puts("\r\n");
    }

    usart1_puts("sd: reading FAT sector at lba ");
    usart1_put_dec_u32(fat_lba);
    usart1_puts("\r\n");
    if (!sd_read_block(fat_lba, g_sector0)) {
        return false;
    }
    sd_print_data_prefix("sd: FAT[0] first16=", g_sector0, 16u);
    return true;
}

static bool fat32_parse_volume(const uint8_t *boot_sector, uint32_t volume_lba, fat32_volume_t *volume)
{
    uint32_t total_sectors;
    uint32_t data_sectors;

    volume->bytes_per_sector = read_le16(boot_sector + 11u);
    volume->sectors_per_cluster = boot_sector[13];
    volume->reserved_sectors = read_le16(boot_sector + 14u);
    volume->fat_count = boot_sector[16];
    volume->sectors_per_fat = read_le32(boot_sector + 36u);
    volume->root_cluster = read_le32(boot_sector + 44u);
    total_sectors = read_le32(boot_sector + 32u);
    if (total_sectors == 0u) {
        total_sectors = read_le16(boot_sector + 19u);
    }

    if (volume->bytes_per_sector != SD_SECTOR_SIZE ||
        volume->sectors_per_cluster == 0u ||
        volume->fat_count == 0u ||
        volume->sectors_per_fat == 0u ||
        volume->root_cluster < 2u) {
        return false;
    }

    volume->volume_lba = volume_lba;
    volume->total_sectors = total_sectors;
    volume->fat_start_lba = volume_lba + (uint32_t)volume->reserved_sectors;
    volume->data_start_lba = volume->fat_start_lba +
                             ((uint32_t)volume->fat_count * volume->sectors_per_fat);
    data_sectors = total_sectors -
                   ((uint32_t)volume->reserved_sectors +
                    ((uint32_t)volume->fat_count * volume->sectors_per_fat));
    volume->cluster_count = data_sectors / (uint32_t)volume->sectors_per_cluster;
    return true;
}

static uint32_t fat32_cluster_to_lba(const fat32_volume_t *volume, uint32_t cluster)
{
    return volume->data_start_lba +
           ((cluster - 2u) * (uint32_t)volume->sectors_per_cluster);
}

static bool fat32_read_fat_entry(const fat32_volume_t *volume, uint32_t cluster, uint32_t *next_cluster_out)
{
    uint32_t fat_offset = cluster * 4u;
    uint32_t fat_sector_lba = volume->fat_start_lba + (fat_offset / SD_SECTOR_SIZE);
    uint32_t fat_sector_offset = fat_offset % SD_SECTOR_SIZE;

    if (!sd_read_block(fat_sector_lba, g_sector0)) {
        return false;
    }

    *next_cluster_out = read_le32(g_sector0 + fat_sector_offset) & 0x0FFFFFFFu;
    return true;
}

static bool fat32_cluster_is_eoc(uint32_t cluster)
{
    return cluster >= 0x0FFFFFF8u;
}

static void fat32_format_short_name(const uint8_t *raw_name, char *out, uint32_t out_size)
{
    uint32_t i;
    uint32_t pos = 0u;
    uint32_t base_len = 8u;
    uint32_t ext_len = 3u;

    while (base_len > 0u && raw_name[base_len - 1u] == ' ') {
        base_len--;
    }
    while (ext_len > 0u && raw_name[8u + ext_len - 1u] == ' ') {
        ext_len--;
    }

    if (out_size == 0u) {
        return;
    }

    for (i = 0u; i < base_len && pos + 1u < out_size; i++) {
        out[pos++] = (char)raw_name[i];
    }
    if (ext_len > 0u && pos + 1u < out_size) {
        out[pos++] = '.';
        for (i = 0u; i < ext_len && pos + 1u < out_size; i++) {
            out[pos++] = (char)raw_name[8u + i];
        }
    }
    out[pos] = '\0';
}

static void fat32_print_dir_entry(const fat32_dir_entry_t *entry)
{
    char name[16];

    fat32_format_short_name(entry->short_name, name, sizeof(name));
    usart1_puts("fat32: ");
    if ((entry->attr & 0x10u) != 0u) {
        usart1_puts("DIR  ");
    } else {
        usart1_puts("FILE ");
    }
    usart1_puts(name);
    usart1_puts(" cluster=");
    usart1_put_dec_u32(entry->first_cluster);
    usart1_puts(" size=");
    usart1_put_dec_u32(entry->size_bytes);
    usart1_puts("\r\n");
}

static bool fat32_parse_dir_entry(const uint8_t *raw, fat32_dir_entry_t *entry)
{
    uint8_t attr = raw[11];

    if (raw[0] == 0x00u || raw[0] == 0xE5u || attr == 0x0Fu) {
        return false;
    }

    for (uint32_t i = 0u; i < 11u; i++) {
        entry->short_name[i] = raw[i];
    }
    entry->attr = attr;
    entry->first_cluster = ((uint32_t)read_le16(raw + 20u) << 16) |
                           (uint32_t)read_le16(raw + 26u);
    entry->size_bytes = read_le32(raw + 28u);
    return true;
}

static bool fat32_list_directory(const fat32_volume_t *volume, uint32_t start_cluster, uint32_t max_entries)
{
    uint32_t cluster = start_cluster;
    uint32_t printed = 0u;

    while (cluster >= 2u && !fat32_cluster_is_eoc(cluster)) {
        uint32_t sector_index;

        for (sector_index = 0u; sector_index < volume->sectors_per_cluster; sector_index++) {
            uint32_t lba = fat32_cluster_to_lba(volume, cluster) + sector_index;
            uint32_t offset;

            if (!sd_read_block(lba, g_sector0)) {
                return false;
            }

            for (offset = 0u; offset < SD_SECTOR_SIZE; offset += 32u) {
                fat32_dir_entry_t entry;
                const uint8_t *raw = g_sector0 + offset;

                if (raw[0] == 0x00u) {
                    return true;
                }
                if (!fat32_parse_dir_entry(raw, &entry)) {
                    continue;
                }
                fat32_print_dir_entry(&entry);
                printed++;
                if (printed >= max_entries) {
                    usart1_puts("fat32: directory listing truncated\r\n");
                    return true;
                }
            }
        }

