jdesbonnet/codex_experiment_06/projects/sd_fat32_ro/stm32f103c8_c/main.c
        if (!fat32_read_fat_entry(volume, cluster, &cluster)) {
            return false;
        }
    }

    return true;
}

static bool fat32_find_in_root(const fat32_volume_t *volume, const uint8_t target_name[11], fat32_dir_entry_t *match)
{
    uint32_t cluster = volume->root_cluster;

    while (cluster >= 2u && !fat32_cluster_is_eoc(cluster)) {
        uint32_t sector_index;

        for (sector_index = 0u; sector_index < volume->sectors_per_cluster; sector_index++) {
            uint32_t lba = fat32_cluster_to_lba(volume, cluster) + sector_index;
            uint32_t offset;

            if (!sd_read_block(lba, g_sector0)) {
                return false;
            }

            for (offset = 0u; offset < SD_SECTOR_SIZE; offset += 32u) {
                fat32_dir_entry_t entry;
                const uint8_t *raw = g_sector0 + offset;
                uint32_t i;
                bool same = true;

                if (raw[0] == 0x00u) {
                    return false;
                }
                if (!fat32_parse_dir_entry(raw, &entry)) {
                    continue;
                }

                for (i = 0u; i < 11u; i++) {
                    if (entry.short_name[i] != target_name[i]) {
                        same = false;
                        break;
                    }
                }
                if (same) {
                    *match = entry;
                    return true;
                }
            }
        }

        if (!fat32_read_fat_entry(volume, cluster, &cluster)) {
            return false;
        }
    }

    return false;
}

static bool fat32_dump_file_prefix(const fat32_volume_t *volume,
                                   const fat32_dir_entry_t *entry,
                                   uint32_t max_bytes)
{
    uint32_t cluster = entry->first_cluster;
    uint32_t remaining = entry->size_bytes;
    uint32_t emitted = 0u;

    if ((entry->attr & 0x10u) != 0u) {
        return false;
    }

    if (max_bytes < remaining) {
        remaining = max_bytes;
    }

    while (cluster >= 2u && !fat32_cluster_is_eoc(cluster) && remaining > 0u) {
        uint32_t sector_index;

        for (sector_index = 0u; sector_index < volume->sectors_per_cluster && remaining > 0u; sector_index++) {
            uint32_t lba = fat32_cluster_to_lba(volume, cluster) + sector_index;
            uint32_t byte_count = remaining;
            uint32_t i;

            if (byte_count > SD_SECTOR_SIZE) {
                byte_count = SD_SECTOR_SIZE;
            }
            if (!sd_read_block(lba, g_sector0)) {
                return false;
            }

            for (i = 0u; i < byte_count; i++) {
                usart1_put_escaped_byte(g_sector0[i]);
            }
            emitted += byte_count;
            remaining -= byte_count;
        }

        if (remaining > 0u) {
            if (!fat32_read_fat_entry(volume, cluster, &cluster)) {
                return false;
            }
        }
    }

    if (emitted < entry->size_bytes) {
        usart1_puts("...");
    }
    usart1_puts("\r\n");
    return true;
}

static void sd_print_cid_summary(const uint8_t *cid)
{
    uint32_t serial = ((uint32_t)cid[9] << 24) |
                      ((uint32_t)cid[10] << 16) |
                      ((uint32_t)cid[11] << 8) |
                      (uint32_t)cid[12];
    uint32_t year = 2000u + sd_extract_bits(cid, 19u, 12u);
    uint32_t month = sd_extract_bits(cid, 11u, 8u);

    usart1_puts("sd: CID raw: ");
    sd_print_bytes(cid, 16u);

    usart1_puts("sd: CID MID=0x");
    usart1_put_hex8(cid[0]);
    usart1_puts(" OID=");
    usart1_putc((char)cid[1]);
    usart1_putc((char)cid[2]);
    usart1_puts(" PNM=");
    usart1_putc((char)cid[3]);
    usart1_putc((char)cid[4]);
    usart1_putc((char)cid[5]);
    usart1_putc((char)cid[6]);
    usart1_putc((char)cid[7]);
    usart1_puts(" PRV=");
    usart1_put_dec_u32((uint32_t)(cid[8] >> 4));
    usart1_putc('.');
    usart1_put_dec_u32((uint32_t)(cid[8] & 0x0Fu));
    usart1_puts(" PSN=0x");
    usart1_put_hex32(serial);
    usart1_puts(" MDT=");
    usart1_put_dec_u32(year);
    usart1_putc('-');
    if (month < 10u) {
        usart1_putc('0');
    }
    usart1_put_dec_u32(month);
    usart1_puts("\r\n");
}

static void sd_print_csd_summary(const uint8_t *csd)
{
    uint32_t csd_structure = sd_extract_bits(csd, 127u, 126u);
    uint32_t sector_count = 0u;
    uint32_t capacity_mib;

    usart1_puts("sd: CSD raw: ");
    sd_print_bytes(csd, 16u);
    usart1_puts("sd: CSD structure ");
    usart1_put_dec_u32(csd_structure);
    usart1_puts("\r\n");

    if (csd_structure == 1u) {
        uint32_t c_size = sd_extract_bits(csd, 69u, 48u);
        sector_count = (c_size + 1u) * 1024u;
    } else if (csd_structure == 0u) {
        uint32_t read_bl_len = sd_extract_bits(csd, 83u, 80u);
        uint32_t c_size = sd_extract_bits(csd, 73u, 62u);
        uint32_t c_size_mult = sd_extract_bits(csd, 49u, 47u);
        uint32_t block_len = 1u << read_bl_len;
        uint32_t blocknr = (c_size + 1u) * (1u << (c_size_mult + 2u));
        sector_count = (blocknr * block_len) / SD_SECTOR_SIZE;
    }

    if (sector_count != 0u) {
        capacity_mib = sector_count / 2048u;
        usart1_puts("sd: sectors=");
        usart1_put_dec_u32(sector_count);
        usart1_puts(" capacity_mib=");
        usart1_put_dec_u32(capacity_mib);
        usart1_puts("\r\n");
    } else {
        usart1_puts("sd: capacity parse unsupported for this CSD layout\r\n");
    }
}

static bool sd_card_init(uint32_t *ocr_out, uint8_t *cid, uint8_t *csd)
{
    uint32_t i;
    uint8_t r1;
    uint8_t r7[4];

    g_sd_is_sdhc = false;

    sd_send_initial_clocks();

    usart1_puts("sd: CMD0...\r\n");
    for (i = 0u; i < 20u; i++) {
        r1 = sd_send_command(SD_CMD0, 0u, 0x95u);
        if (r1 == SD_R1_IDLE) {
            break;
        }
    }
    usart1_puts("sd: CMD0 R1=0x");
    usart1_put_hex8(r1);
    usart1_puts("\r\n");
    if (r1 != SD_R1_IDLE) {
        return false;
    }

