jdesbonnet/codex_experiment_06/projects/sd_fat32_ro/stm32f103c8_c/main.c
    sd_deselect();
    if (!sd_select()) {
        sd_deselect();
        return false;
    }
    r1 = sd_send_command_selected(SD_CMD8, 0x000001AAu, 0x87u);
    r7[0] = sd_spi_xfer(0xFFu);
    r7[1] = sd_spi_xfer(0xFFu);
    r7[2] = sd_spi_xfer(0xFFu);
    r7[3] = sd_spi_xfer(0xFFu);
    sd_deselect();

    usart1_puts("sd: CMD8 R1=0x");
    usart1_put_hex8(r1);
    usart1_puts(" R7=");
    usart1_put_hex8(r7[0]);
    usart1_putc(' ');
    usart1_put_hex8(r7[1]);
    usart1_putc(' ');
    usart1_put_hex8(r7[2]);
    usart1_putc(' ');
    usart1_put_hex8(r7[3]);
    usart1_puts("\r\n");

    if ((r1 & SD_R1_ILLEGAL) == 0u) {
        for (i = 0u; i < 1000u; i++) {
            r1 = sd_send_app_command(SD_ACMD41, 0x40000000u);
            if (r1 == 0x00u) {
                break;
            }
        }
        usart1_puts("sd: ACMD41(v2) polls=");
        usart1_put_dec_u32(i + 1u);
        usart1_puts(" R1=0x");
        usart1_put_hex8(r1);
        usart1_puts("\r\n");
        if (r1 != 0x00u) {
            return false;
        }
    } else {
        for (i = 0u; i < 1000u; i++) {
            r1 = sd_send_app_command(SD_ACMD41, 0u);
            if (r1 == 0x00u) {
                break;
            }
        }
        usart1_puts("sd: ACMD41(v1) polls=");
        usart1_put_dec_u32(i + 1u);
        usart1_puts(" R1=0x");
        usart1_put_hex8(r1);
        usart1_puts("\r\n");
        if (r1 != 0x00u) {
            return false;
        }
    }

    if (!sd_read_ocr(ocr_out)) {
        return false;
    }
    g_sd_is_sdhc = ((*ocr_out & 0x40000000u) != 0u);

    usart1_puts("sd: OCR=0x");
    usart1_put_hex32(*ocr_out);
    usart1_puts(" type=");
    usart1_puts(g_sd_is_sdhc ? "SDHC/SDXC" : "SDSC");
    usart1_puts("\r\n");

    if (!g_sd_is_sdhc) {
        r1 = sd_send_command(SD_CMD16, SD_SECTOR_SIZE, 0xFFu);
        usart1_puts("sd: CMD16 R1=0x");
        usart1_put_hex8(r1);
        usart1_puts("\r\n");
        if (r1 != 0x00u) {
            return false;
        }
    }

    if (!sd_read_register(SD_CMD10, cid)) {
        return false;
    }
    if (!sd_read_register(SD_CMD9, csd)) {
        return false;
    }

    sd_spi_set_prescaler(SD_SPI_BR_RUN);
    return true;
}

int main(void)
{
    uint32_t ocr = 0u;
    uint32_t volume_lba = 0u;
    uint8_t volume_type = 0u;
    uint8_t cid[16];
    uint8_t csd[16];
    fat32_volume_t volume;
    fat32_dir_entry_t file_entry;
    static const uint8_t cmdline_name[11] = { 'C', 'M', 'D', 'L', 'I', 'N', 'E', ' ', 'T', 'X', 'T' };
    static const uint8_t config_name[11] = { 'C', 'O', 'N', 'F', 'I', 'G', ' ', ' ', 'T', 'X', 'T' };

    SystemCoreClockUpdate();
    SysTick_Config(SystemCoreClock / 1000u);
    led_init();
    usart1_init();
    sd_spi_init();

    usart1_puts("\r\nsd_fat32_ro: STM32F103C8 SPI1 / USART1\r\n");
    usart1_puts("sd_fat32_ro: PA4=CS PA5=SCK PA6=MISO PA7=MOSI\r\n");
    usart1_puts("sd_fat32_ro: starting probe in 1000 ms\r\n");
    delay_ms(1000u);

    led_set(true);

    if (!sd_card_init(&ocr, cid, csd)) {
        led_set(false);
        usart1_puts("sd: init failed\r\n");
        while (1) {
            delay_ms(1000u);
        }
    }

    sd_print_cid_summary(cid);
    sd_print_csd_summary(csd);

    usart1_puts("sd: reading sector 0\r\n");
    if (!sd_read_block(0u, g_sector0)) {
        led_set(false);
        usart1_puts("sd: CMD17 block 0 failed\r\n");
        while (1) {
            delay_ms(1000u);
        }
    }

    sd_print_sector_prefix(g_sector0);
    usart1_puts("sd: sector0 signature=0x");
    usart1_put_hex8(g_sector0[511]);
    usart1_put_hex8(g_sector0[510]);
    usart1_puts("\r\n");

    if (sd_find_primary_volume(g_sector0, &volume_lba, &volume_type)) {
        usart1_puts("sd: selected partition type 0x");
        usart1_put_hex8(volume_type);
        usart1_puts("\r\n");
        usart1_puts("sd: reading boot sector at lba ");
        usart1_put_dec_u32(volume_lba);
        usart1_puts("\r\n");
        if (!sd_read_block(volume_lba, g_sector0)) {
            led_set(false);
            usart1_puts("sd: boot sector read failed\r\n");
            while (1) {
                delay_ms(1000u);
            }
        }
    } else {
        usart1_puts("sd: no partition entry found; treating sector 0 as boot sector\r\n");
        volume_lba = 0u;
    }

    sd_print_boot_sector_summary(g_sector0, volume_lba);
    if (sd_is_fat32_boot_sector(g_sector0)) {
        if (!fat32_parse_volume(g_sector0, volume_lba, &volume)) {
            led_set(false);
            usart1_puts("fat32: unsupported BPB\r\n");
            while (1) {
                delay_ms(1000u);
            }
        }

        if (!sd_probe_fat32_aux(volume_lba, g_sector0)) {
            led_set(false);
            usart1_puts("sd: FAT32 auxiliary probe failed\r\n");
            while (1) {
                delay_ms(1000u);
            }
        }

        usart1_puts("fat32: root directory\r\n");
        if (!fat32_list_directory(&volume, volume.root_cluster, 64u)) {
            led_set(false);
            usart1_puts("fat32: root directory read failed\r\n");
            while (1) {
                delay_ms(1000u);
            }
        }

        if (fat32_find_in_root(&volume, cmdline_name, &file_entry)) {
            usart1_puts("fat32: CMDLINE.TXT ");
            usart1_put_dec_u32(file_entry.size_bytes);
            usart1_puts(" bytes: ");
            if (!fat32_dump_file_prefix(&volume, &file_entry, 160u)) {
                led_set(false);
                usart1_puts("fat32: CMDLINE.TXT read failed\r\n");
                while (1) {
                    delay_ms(1000u);
                }
            }
        }

        if (fat32_find_in_root(&volume, config_name, &file_entry)) {
            usart1_puts("fat32: CONFIG.TXT prefix: ");
            if (!fat32_dump_file_prefix(&volume, &file_entry, 160u)) {
                led_set(false);
                usart1_puts("fat32: CONFIG.TXT read failed\r\n");
                while (1) {
                    delay_ms(1000u);
                }
            }
        }
    } else {
        usart1_puts("fat32: selected volume is not FAT32\r\n");
    }
    usart1_puts("sd_fat32_ro: complete\r\n");
    led_set(false);

    while (1) {
        delay_ms(1000u);
    }
}
